// #include <bits/stdc++.h>
// using namespace std;
// int main()
// {
//     // ১ম টাইপঃ

//     int n;

//     cin >> n; // প্রথমে ভেক্টর এর সাইজ নেয়া হলো

//     vector<int> v; // একটি ইন্টিজার ডাটা টাইপের ভেক্টর ডিক্লেয়ার করা হলো

//     for (int i = 0; i < n; i++)
//     { // একটি n এর লুপ চালিয়ে ভ্যালু গুলা ইনপুট নেয়া হলো

//         int x;

//         cin >> x; // একটি ইন্টিজার ভ্যারিয়েবলে কারেন্ট এলিমেন্ট কে স্টোর করে রাখা হলো

//         v.push_back(x); // x ভ্যারিয়েবল এর মান টিকে ভেক্টর এ পুশ / একদম ডান পাশে insert করা হলো।
//     }

//     return 0;
// }

// *** TYPE-2:
#include <bits/stdc++.h>
using namespace std;
int main()
{
    int n;
    cin >> n; // প্রথমে ভেক্টর এর সাইজ নেয়া হলো

    vector<int> v(n); // একটি ইন্টিজার ডাটা টাইপের n সাইজের ভেক্টর ডিক্লেয়ার করা হলো

    for (int i = 0; i < n; i++)
    { // একটি n এর লুপ চালিয়ে ভ্যালু গুলা ইনপুট নেয়া হলো

        cin >> v[i]; // প্রতিটি ইন্ডেক্স এক্সেস করে সেখানে ভ্যালু গুলা ইনপুট নেয়া হলো।
    }

    return 0;
}
